<template>
  <main class="homepage">
    <div class="homepage__wrapper">
      <div class="homepage__program">
        <div class="homepage__item homepage__item-btn">
          <router-link :to="'/program'" target="_blank"
            >Перейти к программе</router-link
          >
          <div class="homepage__item_rigth"></div>
        </div>
      </div>
      <div class="homepage__description">
        <div
          class="homepage__item homepage__description-item"
          @click="isShowBlock.description = !isShowBlock.description"
        >
          О программе
          <div class="homepage__item_bottom"></div>
        </div>
        <div v-if="isShowBlock.description" class="homepage__description-text">
          <p class="text-paragraph">
            Программное обеспечение разработано с использованием языка
            программирования TypeScript в среде Visual Studio Code версии
            1.55.0, а также с фреймворком Vue.js 2. В работе использована
            библиотека html2canvas, позволяющая преобразовывать элементы DOM в
            изображения base64. Это необходимо для удобного экспорта карт
            раскроя и их печати.
          </p>
          <p class="text-paragraph">
            Программный продукт в выпускной квалификационной работе реализован в
            виде программы для решения задачи двумерного прямоугольного раскроя,
            используя эвристический алгоритм TS и декодер «нижний левый».
          </p>
        </div>
        <div
          class="homepage__item homepage__description-item"
          @click="isShowBlock.instruction = !isShowBlock.instruction"
        >
          Инструкция
          <div class="homepage__item_bottom"></div>
        </div>
        <div v-if="isShowBlock.instruction" class="homepage__description-text">
          <p class="text-paragraph">
            Вначале работы с программой необходимо ввести данные. Задать размеры
            листов для раскроя можно в первом блоке, а также указать припуски на
            обработку листа материала (нобязательный параметр).
          </p>
          <p class="text-paragraph">
            Во втором блоке введите параметры заготовок, параметры припусков
            необязательные. Обязатльный параметр число итераций, не меньше 1
            итерации. Можно добавить каждую заготовку в ручную, можно загрузить
            из файла типа .txt, где в каждой строке заданы параметры отдельной
            заготовки "ширина высота" через пробел.
          </p>
          <p class="text-paragraph">
            Список дефектов так же можно задать в ручную для каждого листа, и
            можно загрузить из файла типа .txt, где в каждой строке прописаны
            параметры одного дефекта "(номер листа - 1) x y ширина высота",
            дефект задается изначально как входной параметр в виде
            прямоугольника наименьшей площади.
          </p>
        </div>
        <div
          class="homepage__item homepage__description-item"
          @click="isShowBlock.theory = !isShowBlock.theory"
        >
          Тоеретические сведения
          <div class="homepage__item_bottom"></div>
        </div>
        <div v-if="isShowBlock.theory" class="homepage__description-text">
          <p class="text-paragraph">
            Данная программа получает наилучший раскрой с помощью алгоритма
            Поиск с запретами. Метод состоит в управляемом локальном поиске в
            пространстве решений, для оптимизации которого используются списки
            запретов. Алгоритмы локального поиска начинают поиск с некоторого
            начального решения и итеративно пытаются заменить текущее решение на
            лучшее в специально определенной окрестности.
          </p>
          <p class="text-paragraph">
            Решение задачи раскроя при использовании метаэвристических
            алгоритмов можно разделить на две части. В первой части работает
            алгоритм, который осуществляет перебор возможных кодировок решения.
            Вторая часть представляет собой реализацию алгоритма-декодера,
            осуществляющего преобразование полученной кодировки в промежуточное
            решение (план раскроя). Кодировка – это приоритетный список
            перестановки номеров заготовок, например, сначала входные детали
            могут быть отсортированы, а затем пронумерованы. Основная функция
            алгоритма-декодера – вычисление целевой функции и восстановление
            плана раскроя из кодировки решения, то есть получение списка
            координат каждой из детали на листе.
          </p>
        </div>
      </div>
    </div>
  </main>
</template>

<script lang="ts" src="./homepage.ts"></script>

<style src="./homepage.css"></style>
